---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassLevelData.ConceptualConstructionIsByEnergyData
source: html/ddb2ff65-36ac-7e6d-68f2-8e96360d6e8c.htm
---
# Autodesk.Revit.DB.Analysis.MassLevelData.ConceptualConstructionIsByEnergyData Property

Indicates if the ConceptualConstructionType of the MassLevelData (Mass Floor) is synchronized
 with the EnergyDataSettings or if it overrides those settings.

## Syntax (C#)
```csharp
public bool ConceptualConstructionIsByEnergyData { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: ConceptualConstructionIsByEnergyData cannot be set to conceptualConstructionIsByEnergyData.